000900   01 EBCDIC-CM-INIT .
000900           03 USER-ID PIC S9999.
000900           03 USER-NAME PIC S9(10).
000900           03 USER-AGE PIC XXX.
000900           03 CM00-INIT .
000900               05 CM00-CUS-BASE-INFO .
000900                   07 CM00-LAST-FOUR-SSN PIC S9999 COMP-5.
000900                   07 CM00-CUS-BASE-INFO-SUB .
000900                       09 CM00-RANDOM-NUM PIC S9(9).
000900                       09 CM00-RANDOM-STRING PIC XXXXX.